--Вивести повні імена лікарів та їх спеціалізації.

select D.Name, D.Surname, S.Name
from Doctors D, DoctorsSpecializations DS, Specializations S
where D.Id = DS.DoctorId and DS.SpecializationId = S.Id



--Вивести прізвища та зарплати (сума ставки та надбавки) лікарів, які не перебувають у відпустці.

select d. Id, Name, Surname, Salary + Premium as TotalSalary
from Doctors D, Vacations V
where D.Id = V.DoctorId and (V.StartDate < GETDATE() and V.EndDate > GETDATE())



--Вивести назви палат, що знаходяться у відділенні «Травматологія».

select W.Name
from Wards W, Departments D
where W.DepartmentId = D.Id and D.Name = N'Травматологія'


--Вивести назви відділень без повторень, що спонсоруються компанією «HealthCorp».

select distinct D.Name
from Departments D, Donations DO, Sponsors S
where D.Id = DO.DepartmentId and DO.SponsorId = S.Id and S.Name = N'HealthCorp'



--Вивести всі пожертвування за останній місяць у вигляді: відділення, спонсор, сума пожертвування, дата пожертвування.
--Вивести прізвища лікарів із зазначенням відділень, у яких вони проводять обстеження. Необхідно враховувати обстеження, що проводяться лише у будні дні.
--Вивести назви палат та корпуси відділень, у яких проводить обстеження лікар «Helen Williams».
--Вивести назви відділень, які отримували пожертвування у розмірі більше 100000, із зазначенням їхніх лікарів.
--Вивести назви відділень, у яких є лікарі, які не отримують надбавки.
--Вивести назви спеціалізацій, що використовуються для лікування захворювань із ступенем тяжкості вище 3.
--Вивести назви відділень та назви захворювань, обстеження яких проводили за останні півроку.
--Вивести назви відділень та назви палат, у яких проводилися обстеження із заразливих захворювань.